[
  {
    "id": "0663694c-d868-11e9-8a34-2a2ae2dbcce4",
    "title": "Shrimp Spaghetti with Tomato Sauce",
    "imageUrl": "https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/7006861.jpg",
    "difficulty": "easy",
    "text": "Ingredients\n\n20 large shrimp, deveined with shell and head left on \n4 tomatoes, or more to taste \n1 bunch flat-leaf parsley, divided \n1\/4 cup extra-virgin olive oil \n1 large onion, chopped \n1 red bell pepper, chopped \n1 fresh red chile pepper, finely chopped \n4 large cloves garlic, sliced, or more to taste \n1\/2 cup water \n2 tablespoons tomato paste \n1 tablespoon dried oregano \nsalt and ground black pepper to taste \n1 teaspoon paprika \n1 5\/8 pounds spaghetti (optional) \n\nDirections\n\n1. Peel shrimp and place skin, heads, and tails into a large saucepan. Fill pan with water and bring to a boil. Reduce heat to low and let simmer, about 45 minutes. \n2. Combine tomatoes and 1\/2 the parsley in a blender; puree until smooth. \n3. Heat olive oil in a separate pan over medium heat. Add onion, bell pepper, and chile pepper; cook and stir until softened, about 5 minutes. Add garlic; cook until fragrant but not browned, 1 to 2 minutes. \n4. Pour pureed tomato mixture into the pan with the peppers. Add water, tomato paste, oregano, salt, and black pepper. Stir well; add paprika. Let sauce simmer on low to medium heat until juices have reduced. \n5. Strain shrimp shells from the water. Bring water back to a boil and add spaghetti. Cook spaghetti, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Reserve 1 cup of the cooking water and drain the rest. \n6. In the meantime, add shrimp to the tomato sauce. Add the reserved water, stir well, and cook until shrimp is pink, about 3 minutes. Plate spaghetti and spoon the sauce on top; garnish with the remaining parsley. \n"
  },
  {
    "id": "06637928-d868-11e9-8a34-2a2ae2dbcce4",
    "title": "Cinnamon Bread I",
    "imageUrl": "https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/4548967.jpg",
    "difficulty": "normal",
    "text": "\"This is a lovely way to start off your morning when you want a little something different than your usual. Note: If you don't have buttermilk you may substitute milk with 1 tablespoon vinegar to measure 1 cup.\"\nIngredients\n\n    2 cups all-purpose flour\n    1 cup white sugar\n    2 teaspoons baking powder\n    1\/2 teaspoon baking soda\n    1 1\/2 teaspoons ground cinnamon\n    1 teaspoon salt\n    1 cup buttermilk\n\n    1\/4 cup vegetable oil\n    2 eggs\n    2 teaspoons vanilla extract\n    2 tablespoons white sugar\n    1 teaspoon ground cinnamon\n    2 teaspoons margarine\n\nDirections\n\n    Preheat oven to 350 degrees F (175 degrees C). Grease one 9x5 inch loaf pan.\n    Measure flour, 1 cup sugar, baking powder, baking soda, 1 1\/2 teaspoons cinnamon, salt, buttermilk, oil, eggs and vanilla into large mixing bowl. Beat 3 minutes. Pour into prepared loaf pan. Smooth top.\n    Combine 2 tablespoons white sugar, 1 teaspoon cinnamon and butter, mixing until crumbly. Sprinkle topping over smoothed batter. Using knife, cut in a light swirling motion to give a marbled effect.\n    Bake for about 50 minutes. Test with toothpick. When inserted it should come out clean. Remove bread from pan to rack to cool.\n"
  },
  {
    "id": "06636d70-d868-11e9-8a34-2a2ae2dbcce4",
    "title": "Million-Dollar Spaghetti",
    "imageUrl": "https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1004408.jpg",
    "difficulty": "hard",
    "text": "\"The perfect combination of pasta, ground beef, and cream cheese mixture. Unbelievably good! Serve with garlic bread and salad. Enjoy!\"\nIngredients\n\n    1 (8 ounce) package spaghetti\n    1 pound lean ground beef\n    1 (16 ounce) jar spaghetti sauce\n    1\/2 cup butter, sliced - divided\n\n    1 (8 ounce) container cottage cheese\n    1 (8 ounce) package cream cheese, softened\n    1\/4 cup sour cream\n    1 (8 ounce) package shredded sharp Cheddar cheese\n\nDirections\n\n    Preheat oven to 350 degrees F (175 degrees C).\n    Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain.\n    Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Transfer to a bowl and mix spaghetti sauce into ground beef.\n    Place half the slices of butter into the bottom of a 9x13-inch casserole dish. Spread half the spaghetti into the dish. Mix cottage cheese, cream cheese, and sour cream together in a bowl; spread mixture over spaghetti. Layer remaining spaghetti over creamy mixture. Top with remaining pats of butter.\n    Pour ground beef mixture over spaghetti and spread to cover casserole.\n    Bake in the preheated oven for 30 minutes. Spread Cheddar cheese over casserole and continue baking until cheese has melted and is lightly browned, about 15 more minutes.\n"
  },
  {
    "id": "06636ee2-d868-11e9-8a34-2a2ae2dbcce4",
    "title": "Peach Cobbler Dump Cake I",
    "imageUrl": "https:\/\/images.media-allrecipes.com\/userphotos\/720x405\/6500176.jpg",
    "difficulty": "normal",
    "text": "\"Yellow cake mix and peaches canned in heavy syrup are the primary components in this simple dump cake recipe.\"\nIngredients\n\n    2 (16 ounce) cans peaches in heavy syrup\n    1 (18.25 ounce) package yellow cake mix\n\n    1\/2 cup butter\n    1\/2 teaspoon ground cinnamon, or to taste\n\nDirections\n\n    Preheat oven to 375 degrees F (190 degrees C).\n    Empty peaches into the bottom of one 9x13 inch pan. Cover with the dry cake mix and press down firmly. Cut butter into small pieces and place on top of cake mix. Sprinkle top with cinnamon.\n    Bake at 375 degrees F (190 degrees C) for 45 minutes.\n"
  },
  {
    "id": "06637022-d868-11e9-8a34-2a2ae2dbcce4",
    "title": "Slow Cooker Salisbury Steak",
    "imageUrl": "https:\/\/images.media-allrecipes.com\/userphotos\/720x405\/4036171.jpg",
    "difficulty": "easy",
    "text": "\"This recipe goes together quickly and does not need a lot of time in the slow cooker. It's a delicious way to add flavor to ground beef and the children love it! The gravy is delightful served over mashed potatoes.\"\nIngredients\n\n    2 pounds lean ground beef\n    1 (1 ounce) envelope dry onion soup mix\n    1\/2 cup Italian seasoned bread crumbs\n    1\/4 cup milk\n    1\/4 cup all-purpose flour\n\n    2 tablespoons vegetable oil\n    2 (10.75 ounce) cans condensed cream of chicken soup\n    1 (1 ounce) packet dry au jus mix\n    3\/4 cup water\n\nDirections\n\n    In a large bowl, mix together the ground beef, onion soup mix, bread crumbs, and milk using your hands. Shape into 8 patties.\n    Heat the oil in a large skillet over medium-high heat. Dredge the patties in flour just to coat, and quickly brown on both sides in the hot skillet. Place browned patties into the slow cooker stacking alternately like a pyramid. In a medium bowl, mix together the cream of chicken soup, au jus mix, and water. Pour over the meat. Cook on the Low setting for 4 or 5 hours, until ground beef is well done.\n"
  },
  {
    "id": "06637158-d868-11e9-8a34-2a2ae2dbcce4",
    "title": "Simple Macaroni and Cheese",
    "imageUrl": "https:\/\/images.media-allrecipes.com\/userphotos\/720x405\/5445825.jpg",
    "difficulty": "easy",
    "text": "\"A very quick and easy fix to a tasty side-dish. Fancy, designer mac and cheese often costs forty or fifty dollars to prepare when you have so many exotic and expensive cheeses, but they aren't always the best tasting. This recipe is cheap and tasty.\"\nIngredients\n\n    1 (8 ounce) box elbow macaroni\n    1\/4 cup butter\n    1\/4 cup all-purpose flour\n    1\/2 teaspoon salt\n\n    ground black pepper to taste\n    2 cups milk\n    2 cups shredded Cheddar cheese\n\nDirections\n\n    Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.\n    Melt butter in a saucepan over medium heat; stir in flour, salt, and pepper until smooth, about 5 minutes. Slowly pour milk into butter-flour mixture while continuously stirring until mixture is smooth and bubbling, about 5 minutes. Add Cheddar cheese to milk mixture and stir until cheese is melted, 2 to 4 minutes.\n    Fold macaroni into cheese sauce until coated.\n"
  },
  {
    "id": "066372ac-d868-11e9-8a34-2a2ae2dbcce4",
    "title": "Tuna Noodle Casserole from Scratch",
    "imageUrl": "https:\/\/images.media-allrecipes.com\/userphotos\/720x405\/2612540.jpg",
    "difficulty": "normal",
    "text": "\"No canned soup mix in this recipe! Mushrooms, onions, celery, and peas all go into this comfort casserole.\"\nIngredients\n\n    1\/2 cup butter, divided\n    1 (8 ounce) package uncooked medium egg noodles\n    1\/2 medium onion, finely chopped\n    1 stalk celery, finely chopped\n    1 clove garlic, minced\n    8 ounces button mushrooms, sliced\n    1\/4 cup all-purpose flour\n\n    2 cups milk\n    salt and pepper to taste\n    2 (5 ounce) cans tuna, drained and flaked\n    1 cup frozen peas, thawed\n    3 tablespoons bread crumbs\n    2 tablespoons butter, melted\n    1 cup shredded Cheddar cheese\n\nDirections\n\n    Preheat oven to 375 degrees F (190 degrees C). Butter a medium baking dish with 1 tablespoon butter.\n    Bring a large pot of lightly salted water to a boil. Add egg noodles, cook for 8 to 10 minutes, until al dente, and drain.\n    Melt 1 tablespoon butter in a skillet over medium-low heat. Stir in the onion, celery, and garlic, and cook 5 minutes, until tender. Increase heat to medium-high, and mix in mushrooms. Continue to cook and stir 5 minutes, or until most of the liquid has evaporated.\n    Melt 4 tablespoons butter in a medium saucepan, and whisk in flour until smooth. Gradually whisk in milk, and continue cooking 5 minutes, until sauce is smooth and slightly thickened. Season with salt and pepper. Stir in tuna, peas, mushroom mixture, and cooked noodles. Transfer to the baking dish. Melt remaining 2 tablespoons butter in a small bowl, mix with bread crumbs, and sprinkle over the casserole. Top with cheese.\n    Bake 25 minutes in the preheated oven, or until bubbly and lightly browned.\n"
  },
  {
    "id": "066373e2-d868-11e9-8a34-2a2ae2dbcce4",
    "title": "Roasted Cherry Tomatoes with Angel Hair",
    "imageUrl": "https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/3838278.jpg",
    "difficulty": "hard",
    "text": "\"This is something I threw together one day when I was faced with an abundance of fresh cherry tomatoes and basil from my garden. Delish!\"\nIngredients\n\n    1 (10 ounce) basket cherry tomatoes, halved\n    1 tablespoon olive oil\n    1 teaspoon minced garlic\n    salt and ground black pepper to taste\n\n    4 ounces angel hair pasta\n    3 basil leaves, cut into thin strips, or more to taste\n    1 dash red pepper flakes\n    2 tablespoons fresh grated Parmesan cheese, or to taste (optional)\n\nDirections\n\n    Preheat oven to 375 degrees F (190 degrees C).\n    Combine tomatoes, olive oil, garlic, salt, and pepper in a bowl until well mixed; spread on a shallow-sided baking sheet.\n    Bake in the preheated oven until tomatoes are soft and wrinkled, 25 to 30 minutes.\n    Bring a large pot of lightly salted water to a boil. Cook angel hair pasta in the boiling water, stirring occasionally until tender yet firm to the bite, 4 to 5 minutes. Drain; reserving a small amount of cooking water.\n    Spoon tomatoes with their juices into a small saucepan; add basil and red pepper flakes. Mix in reserved cooking water to thin tomato mixture to desired consistency. Cook and stir over low heat until warmed, about 5 minutes; stir in pasta. Top with Parmesan cheese before serving.\n"
  },
  {
    "id": "0663750e-d868-11e9-8a34-2a2ae2dbcce4",
    "title": "Fruity Chicken Salad with Tarragon",
    "imageUrl": "https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/6973686.jpg",
    "difficulty": "normal",
    "text": "\"Chicken salad often finds its way to my summer menus, served on greens or a croissant. I think this one is just a little special. It's sweet and juicy from the apples and grapes, a little savory from the tarragon, crunchy from the pecans and celery, and lightened up a bit with some yogurt.\"\nIngredients\n\n    1 1\/2 cups grilled skinless, boneless chicken thighs, chopped\n    1\/2 red apple - peeled, cored, and diced\n    1\/2 cup halved green grapes\n    1\/3 cup toasted chopped pecans\n    1\/4 cup diced red onion\n    1\/4 cup diced celery\n\n    1\/4 cup mayonnaise\n    1\/4 cup low-fat plain Greek yogurt\n    2 tablespoons chopped fresh tarragon\n    1 teaspoon Dijon mustard\n    1 lime, zested and juiced\n    salt and freshly ground black pepper to taste\n\nDirections\n\n    Combine chicken, apple, grapes, pecans, red onion, and celery in a medium bowl.\n    Whisk mayonnaise, yogurt, tarragon, Dijon mustard, and lime zest and juice together in a small bowl. Stir dressing into the chicken mixture. Season with salt and pepper.\n"
  },
  {
    "id": "066377d4-d868-11e9-8a34-2a2ae2dbcce4",
    "title": "Buttered Biscuits",
    "imageUrl": "https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/6944495.jpg",
    "difficulty": "hard",
    "text": "\"These biscuits are very easy to make and are very good.\"\nIngredients\n\n    2 cups self-rising flour\n    1\/2 cup butter or margarine\n\n    2\/3 cup buttermilk\n\nDirections\n\n    Preheat an oven to 450 degrees F (230 degrees C). Grease a baking sheet or line it with parchment paper.\n    Cut butter into flour until the size of small peas. Pour in the buttermilk and stir just until combined.\n    Drop by rounded tablespoonfuls on prepared baking sheet. Bake until golden brown, about 10 minutes.\n"
  }
]